# MakeEmpty Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ComponentRepeaterSlot..::..MakeEmpty Method
ComponentRepeaterSlot Class See Also
---
Makes the slot empty by removing the instance currently held by the slot.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void MakeEmpty()
```

Visual Basic
---
```text
Public Sub MakeEmpty
```

Visual C++
---
```text
public:
void MakeEmpty()
```

# See Also
ComponentRepeaterSlot Class
Autodesk.Revit.DB Namespace